 

 Devices in the Network:

1. Router0:
   Model: ISR4331
   IP Address:
   GigabitEthernet0/0/0: 168.90.0.1
   GigabitEthernet0/0/1: 210.3.14.1

2. Switch 0:
   - Model: 2960 IOS15
   - Connected Devices:
   - PC0: 168.90.0.2
   - PC1: 168.90.0.3
   - PC2: 169.90.0.6
   - Laptop0: 168.90.0.4
   - Server0: 168.90.0.5

3. Switch 1:
   - Model: 2960 IOS15
   - Connected Devices:
   - PC3: 210.3.14.5
   - PC4: 210.3.14.2
   - Server1: 210.3.14.3
   - Server2: 210.3.14.4

 Assigned IP Addresses(USING DHCP):

- Laptop0: 168.90.0.4
- PC0: 168.90.0.2 
- PC1: 168.90.0.3 
- PC3: 210.3.14.5 
- Server0: 168.90.0.5 
- Server1: 210.3.14.3 
- Server2: 210.3.14.4

Setting up DHCP
STEP 1 GO in to configuration mode
Router# configure terminal

Step 2 Assign IP ADDRESES TO ROUTER

First network:

Router(config)# interface GigabitEthernet0/0/0
Router(config-if)# ip address 168.90.0.1 255.255.0.0
Router(config-if)# no shutdown
Router(config-if)# exit

Second network:

Router(config)# interface GigabitEthernet0/0/1
Router(config-if)# ip address 210.3.14.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit

STEP 3 SET IP DHCP IN ROUTER

First network:

Router(config)# ip dhcp pool FIRST_NETWORK
Router(dhcp-config)# network 168.90.0.0 255.255.0.0
Router(dhcp-config)# default-router 168.90.0.1
Router(dhcp-config)# exit

Second network:

Router(config)# ip dhcp pool SECOND_NETWORK
Router(dhcp-config)# network 210.3.14.0 255.255.255.0
Router(dhcp-config)# default-router 210.3.14.1
Router(dhcp-config)# exit

STEP 4 EXLCUDING IP ADDRESSES FOR THE ROUTER

Router(config)# ip dhcp excluded-address 168.90.0.1
Router(config)# ip dhcp excluded-address 210.3.14.1


